app/views/articles/show.html.erb

      <h3>Comments</h3>
        <% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]